# id - идентификатор ученика
# name - имя
# surname - фамилия
# patronymic - отчество
# gender - пол
# birth_day - день рождения
# email - электронный ящик
# education - предыдущее образование
# skills - навыки связанные с программированием
# course_start - дата начала курса
# course_end - дата окончания курса
# teacher - преподаватель
# classroom - аудитория
# lessons_name - названия лекций
# tasks - домашние задания
# tasks_completed - зачтенные задания
# payment - оплата курса
# rewiews - отзывы по окончанию обучения
# job - варианты дальнейшего трудоустройства

