import pandas as pd
import math

# Создаем спецификацию
dct = {'Название':['Полоса', 'Полоса','Полоса','Полоса','Полоса',
                   'Планка', 'Планка', 'Планка', 'Планка','Планка',
                   'Бракета','Бракета', 'Бракета','Бракета','Бракета',
                   'Бракета', 'Бракета', 'Бракета', 'Бракета', 'Бракета',
                   'Кница','Кница', 'Кница', 'Кница', 'Кница',
                   'Кница', 'Кница', 'Кница', 'Кница', 'Кница',
                   'Кница', 'Кница', 'Кница', 'Кница', 'Кница'],
       'Марка материала':['Сталь_1','Сталь_1','Сталь_1', 'Сталь_1', 'Сталь_1',
                          'Сталь_2','Сталь_2','Сталь_2', 'Сталь_2', 'Сталь_2',
                          'Сталь_3','Сталь_3','Сталь_3', 'Сталь_3', 'Сталь_3',
                          'Сталь_3','Сталь_3','Сталь_3', 'Сталь_3', 'Сталь_3',
                          'Сталь_5','Сталь_5','Сталь_5', 'Сталь_5', 'Сталь_5',
                          'Сталь_6','Сталь_6','Сталь_6', 'Сталь_6', 'Сталь_6',
                          'Сталь_4','Сталь_4','Сталь_4', 'Сталь_4', 'Сталь_4'],
       'Толщина(мм)':[4, 4, 4, 4, 4,
                      6, 6, 6, 6, 6,
                      4, 4, 4, 4, 4,
                      2, 2, 2, 2, 2,
                      2, 2, 2, 2, 2,
                      6, 6, 6, 6, 6,
                      6, 6, 6, 6, 6],
       'Вид':['Вид сверху', 'Продольный разрез', 'Вид сверху', 'Вид сверху', 'А-А',
              'Г-Г', 'Продольный разрез', 'Вид сверху', 'Вид сверху', 'А-А',
              'Вид сверху', 'В-В', 'Б-Б', 'Вид сверху', 'А-А',
              'Б-Б', 'Продольный разрез', 'Вид сверху', 'Вид сверху', 'А-А',
              'В-В', 'Б-Б', 'Вид сверху', 'Вид сверху', 'А-А',
              'Вид сверху', 'Б-Б', 'Вид сверху', 'Вид сверху', 'А-А',
              'Г-Г', 'Продольный разрез', 'Вид сверху', 'Вид сверху', 'А-А'],
       'Масса(кг)':[10, 34, 15, 8, 45,
                    16, 4, 10, 3, 48,
                    145, 12, 9, 8, 14,
                    9, 8, 11, 8, 5,
                    3, 8, 4, 8, 6,
                    10, 10, 3, 5, 4,
                    3, 8, 4, 8, 6],
       'Количество(шт)':[30,40,1,1,3,
                         10,2,1,1,3,
                         3,4,1,1,30,
                         3,4,10,10,3,
                         3,40,1,10,3,
                         5,5,50,5,6,
                         5,50,50,5,6]}
df = pd.DataFrame(dct)
print(df)
df.to_excel('./specification.xlsx')

# Создаем сортамент
sortament_dct = {'Марка материала':['Сталь_1', 'Сталь_1', 'Сталь_1',
                                    'Сталь_2', 'Сталь_2', 'Сталь_2',
                                    'Сталь_3', 'Сталь_3', 'Сталь_3',
                                    'Сталь_4', 'Сталь_4', 'Сталь_4',
                                    'Сталь_5', 'Сталь_5', 'Сталь_5',
                                    'Сталь_6', 'Сталь_6', 'Сталь_6'],
       'Габарит':['1400*6000', '1400*6000', '1400*6000',
                  '1400*6000', '1400*6000', '1400*6000',
                  '1400*6000', '1400*6000', '1400*6000',
                  '1400*5000', '1400*5000', '1400*5000',
                  '1400*5000', '1400*5000', '1400*5000',
                  '1400*5000', '1400*5000', '1400*5000'],
       'Толщина':[2, 4, 6,
                  2, 4, 6,
                  2, 4, 6,
                  2, 4, 6,
                  2, 4, 6,
                  2, 4, 6],
       'Удельный вес':[7.85, 7.85, 7.85,
                       7.85, 7.85, 7.85,
                       7.85, 7.85, 7.85,
                       6.5, 6.5, 6.5,
                       6.5, 6.5, 6.5,
                       6.5, 6.5, 6.5],
       'Масса':[131.88, 263.76, 395.64,
                131.88, 263.76, 395.64,
                131.88, 263.76, 395.64,
                91, 182, 273,
                91, 182, 273,
                91, 182, 273]}
df1 = pd.DataFrame(sortament_dct)
print(df1)
df1.to_excel('./sortament.xlsx')

# Создаем заготовку ведомости заказа материалов
dct_order = {'Название':[],
       'Количество':[],
       'Остаток':[]}


import openpyxl as op

filename1 = 'specification.xlsx'          #input('Введите название файла: ')
wb = op.load_workbook(filename1)
sheet = wb.active
material_dct={}

filename2 = 'sortament.xlsx'          #input('Введите название файла: ')
wb2 = op.load_workbook(filename2)
sheet2 = wb2.active
res={}


# Цикл по строкам
for i in range(2, sheet.max_row + 1):

       weight = sheet.cell(row=i, column=6).value  #вес
       thickness = sheet.cell(row=i, column=4).value #толщина
       material = sheet.cell(row=i, column=3).value #материал
       amount = sheet.cell(row=i, column=7).value  # количество

       if material not in material_dct:
              material_dct[material] = {thickness : weight * amount}
       else:
              if thickness not in material_dct[material]:
                     material_dct[material][thickness] = weight * amount
              else:
                     material_dct[material][thickness] += weight * amount

print(material_dct)

for k,v in material_dct.items():
       for p,q in v.items():
              #print(p,q)
              for h in range(2, sheet2.max_row + 1):

                     weight1 = sheet2.cell(row=h, column=6).value  #вес
                     thickness1 = sheet2.cell(row=h, column=4).value #толщина
                     material1 = sheet2.cell(row=h, column=2).value #материал

                     if material1 == k and thickness1 == p:
                            x = (math.ceil(q / weight1))
                            dct_order['Название'].append(material1 + '_S' + str(thickness1))
                            dct_order['Количество'].append(x)
                            dct_order['Остаток'].append(int(x * weight1 * 1.1 - q))
print(dct_order)
df3 = pd.DataFrame(dct_order)
df3 = df3.sort_values(by = 'Название', ascending=True)
df3.to_excel('./order.xlsx')